YCSB/BenchmarkResults/ThroughputLatencyAndReplicas/GRACE/1.txt
/usr/bin/java  -classpath /home/ayush/work/YCSB/conf:/home/ayush/work/YCSB/core/target/core-0.18.0-SNAPSHOT.jar:/home/ayush/work/YCSB/grace/target/grace-binding-0.18.0-SNAPSHOT.jar:/home/ayush/work/YCSB/grace/target/dependency/HdrHistogram-2.1.12.jar:/home/ayush/work/YCSB/grace/target/dependency/antlr4-runtime-4.9.1.jar:/home/ayush/work/YCSB/grace/target/dependency/caffeine-2.3.1.jar:/home/ayush/work/YCSB/grace/target/dependency/commons-beanutils-1.9.4.jar:/home/ayush/work/YCSB/grace/target/dependency/commons-collections-3.2.2.jar:/home/ayush/work/YCSB/grace/target/dependency/commons-configuration2-2.8.0.jar:/home/ayush/work/YCSB/grace/target/dependency/commons-lang3-3.12.0.jar:/home/ayush/work/YCSB/grace/target/dependency/commons-logging-1.2.jar:/home/ayush/work/YCSB/grace/target/dependency/commons-text-1.10.0.jar:/home/ayush/work/YCSB/grace/target/dependency/error_prone_annotations-2.11.0.jar:/home/ayush/work/YCSB/grace/target/dependency/exp4j-0.4.8.jar:/home/ayush/work/YCSB/grace/target/dependency/failureaccess-1.0.1.jar:/home/ayush/work/YCSB/grace/target/dependency/gremlin-core-3.6.2.jar:/home/ayush/work/YCSB/grace/target/dependency/gremlin-driver-3.7.0.jar:/home/ayush/work/YCSB/grace/target/dependency/gremlin-groovy-3.6.2.jar:/home/ayush/work/YCSB/grace/target/dependency/gremlin-language-3.6.2.jar:/home/ayush/work/YCSB/grace/target/dependency/gremlin-shaded-3.6.2.jar:/home/ayush/work/YCSB/grace/target/dependency/gremlin-util-3.7.0.jar:/home/ayush/work/YCSB/grace/target/dependency/groovy-2.5.15-indy.jar:/home/ayush/work/YCSB/grace/target/dependency/groovy-cli-picocli-2.5.15.jar:/home/ayush/work/YCSB/grace/target/dependency/groovy-console-2.5.15.jar:/home/ayush/work/YCSB/grace/target/dependency/groovy-groovysh-2.5.15-indy.jar:/home/ayush/work/YCSB/grace/target/dependency/groovy-json-2.5.15-indy.jar:/home/ayush/work/YCSB/grace/target/dependency/groovy-jsr223-2.5.15-indy.jar:/home/ayush/work/YCSB/grace/target/dependency/groovy-swing-2.5.15.jar:/home/ayush/work/YCSB/grace/target/dependency/groovy-templates-2.5.15.jar:/home/ayush/work/YCSB/grace/target/dependency/groovy-xml-2.5.15.jar:/home/ayush/work/YCSB/grace/target/dependency/guava-31.1-jre.jar:/home/ayush/work/YCSB/grace/target/dependency/hppc-0.7.1.jar:/home/ayush/work/YCSB/grace/target/dependency/htrace-core4-4.1.0-incubating.jar:/home/ayush/work/YCSB/grace/target/dependency/ivy-2.5.1.jar:/home/ayush/work/YCSB/grace/target/dependency/j2objc-annotations-1.3.jar:/home/ayush/work/YCSB/grace/target/dependency/janusgraph-driver-1.0.0-rc2.jar:/home/ayush/work/YCSB/grace/target/dependency/javatuples-1.2.jar:/home/ayush/work/YCSB/grace/target/dependency/jbcrypt-0.4.jar:/home/ayush/work/YCSB/grace/target/dependency/jcabi-log-0.20.0.jar:/home/ayush/work/YCSB/grace/target/dependency/jcabi-manifests-1.2.1.jar:/home/ayush/work/YCSB/grace/target/dependency/jcl-over-slf4j-1.7.25.jar:/home/ayush/work/YCSB/grace/target/dependency/jline-2.14.6.jar:/home/ayush/work/YCSB/grace/target/dependency/jsr305-3.0.2.jar:/home/ayush/work/YCSB/grace/target/dependency/jts-core-1.17.0.jar:/home/ayush/work/YCSB/grace/target/dependency/listenablefuture-9999.0-empty-to-avoid-conflict-with-guava.jar:/home/ayush/work/YCSB/grace/target/dependency/neo4j-java-driver-4.4.3.jar:/home/ayush/work/YCSB/grace/target/dependency/netty-all-4.1.86.Final.jar:/home/ayush/work/YCSB/grace/target/dependency/netty-buffer-4.1.86.Final.jar:/home/ayush/work/YCSB/grace/target/dependency/netty-codec-4.1.86.Final.jar:/home/ayush/work/YCSB/grace/target/dependency/netty-codec-dns-4.1.86.Final.jar:/home/ayush/work/YCSB/grace/target/dependency/netty-codec-haproxy-4.1.86.Final.jar:/home/ayush/work/YCSB/grace/target/dependency/netty-codec-http-4.1.86.Final.jar:/home/ayush/work/YCSB/grace/target/dependency/netty-codec-http2-4.1.86.Final.jar:/home/ayush/work/YCSB/grace/target/dependency/netty-codec-memcache-4.1.86.Final.jar:/home/ayush/work/YCSB/grace/target/dependency/netty-codec-mqtt-4.1.86.Final.jar:/home/ayush/work/YCSB/grace/target/dependency/netty-codec-redis-4.1.86.Final.jar:/home/ayush/work/YCSB/grace/target/dependency/netty-codec-smtp-4.1.86.Final.jar:/home/ayush/work/YCSB/grace/target/dependency/netty-codec-socks-4.1.86.Final.jar:/home/ayush/work/YCSB/grace/target/dependency/netty-codec-stomp-4.1.86.Final.jar:/home/ayush/work/YCSB/grace/target/dependency/netty-codec-xml-4.1.86.Final.jar:/home/ayush/work/YCSB/grace/target/dependency/netty-common-4.1.86.Final.jar:/home/ayush/work/YCSB/grace/target/dependency/netty-handler-4.1.86.Final.jar:/home/ayush/work/YCSB/grace/target/dependency/netty-handler-proxy-4.1.86.Final.jar:/home/ayush/work/YCSB/grace/target/dependency/netty-handler-ssl-ocsp-4.1.86.Final.jar:/home/ayush/work/YCSB/grace/target/dependency/netty-resolver-4.1.86.Final.jar:/home/ayush/work/YCSB/grace/target/dependency/netty-resolver-dns-4.1.86.Final.jar:/home/ayush/work/YCSB/grace/target/dependency/netty-resolver-dns-classes-macos-4.1.86.Final.jar:/home/ayush/work/YCSB/grace/target/dependency/netty-resolver-dns-native-macos-4.1.86.Final-osx-aarch_64.jar:/home/ayush/work/YCSB/grace/target/dependency/netty-resolver-dns-native-macos-4.1.86.Final-osx-x86_64.jar:/home/ayush/work/YCSB/grace/target/dependency/netty-transport-4.1.86.Final.jar:/home/ayush/work/YCSB/grace/target/dependency/netty-transport-classes-epoll-4.1.86.Final.jar:/home/ayush/work/YCSB/grace/target/dependency/netty-transport-classes-kqueue-4.1.86.Final.jar:/home/ayush/work/YCSB/grace/target/dependency/netty-transport-native-epoll-4.1.86.Final-linux-aarch_64.jar:/home/ayush/work/YCSB/grace/target/dependency/netty-transport-native-epoll-4.1.86.Final-linux-x86_64.jar:/home/ayush/work/YCSB/grace/target/dependency/netty-transport-native-kqueue-4.1.86.Final-osx-aarch_64.jar:/home/ayush/work/YCSB/grace/target/dependency/netty-transport-native-kqueue-4.1.86.Final-osx-x86_64.jar:/home/ayush/work/YCSB/grace/target/dependency/netty-transport-native-unix-common-4.1.86.Final.jar:/home/ayush/work/YCSB/grace/target/dependency/netty-transport-rxtx-4.1.86.Final.jar:/home/ayush/work/YCSB/grace/target/dependency/netty-transport-sctp-4.1.86.Final.jar:/home/ayush/work/YCSB/grace/target/dependency/netty-transport-udt-4.1.86.Final.jar:/home/ayush/work/YCSB/grace/target/dependency/noggit-0.8.jar:/home/ayush/work/YCSB/grace/target/dependency/picocli-4.3.2.jar:/home/ayush/work/YCSB/grace/target/dependency/reactive-streams-1.0.3.jar:/home/ayush/work/YCSB/grace/target/dependency/slf4j-api-1.7.25.jar:/home/ayush/work/YCSB/grace/target/dependency/snakeyaml-1.32.jar:/home/ayush/work/YCSB/grace/target/dependency/spatial4j-0.8.jar site.ycsb.Client -t -db site.ycsb.db.GraceClient -P workloads/workload_grace -p HOSTURI=http://localhost:3000 -p maxexecutiontime=60 -p threadcount=1
Data integrity is enabled.
GraceClient  Created
Starting GRACE client
{deleteproportion=1, recordcount=100000, operationcount=2000000, readproportion=1, workload=site.ycsb.workloads.CoreWorkload, threadcount=1, DBTYPE=neo4j, updateproportion=1, HOSTURI=http://localhost:3000, dotransactions=true, createproportion=1, DBURI=bolt://localhost:7687, maxexecutiontime=60, readallfields=true, db=site.ycsb.db.GraceClient, requestdistribution=latest}
GRACE HOSTURI: http://localhost:3000
DBTYPE: neo4j
DBURI: bolt://localhost:7687
[OVERALL], RunTime(ms), 60006
[OVERALL], Throughput(ops/sec), 225.7440922574409
[TOTAL_GCS_G1_Young_Generation], Count, 5
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 101
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.168316501683165
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 5
[TOTAL_GC_TIME], Time(ms), 101
[TOTAL_GC_TIME_%], Time(%), 0.168316501683165
[REMOVE_VERTEX], Operations, 1005
[REMOVE_VERTEX], AverageLatency(us), 2788.7174129353234
[REMOVE_VERTEX], MinLatency(us), 1465
[REMOVE_VERTEX], MaxLatency(us), 10455
[REMOVE_VERTEX], 50thPercentileLatency(us), 2813
[REMOVE_VERTEX], 95thPercentileLatency(us), 4263
[REMOVE_VERTEX], 99thPercentileLatency(us), 5479
[REMOVE_VERTEX], Return=OK, 1005
[GET_EDGE_WITH_PROPERTY], Operations, 936
[GET_EDGE_WITH_PROPERTY], AverageLatency(us), 3612.3653846153848
[GET_EDGE_WITH_PROPERTY], MinLatency(us), 1939
[GET_EDGE_WITH_PROPERTY], MaxLatency(us), 57791
[GET_EDGE_WITH_PROPERTY], 50thPercentileLatency(us), 3377
[GET_EDGE_WITH_PROPERTY], 95thPercentileLatency(us), 4843
[GET_EDGE_WITH_PROPERTY], 99thPercentileLatency(us), 7563
[GET_EDGE_WITH_PROPERTY], Return=OK, 936
[ADD_EDGE], Operations, 1021
[ADD_EDGE], AverageLatency(us), 10244.269343780607
[ADD_EDGE], MinLatency(us), 1724
[ADD_EDGE], MaxLatency(us), 98303
[ADD_EDGE], 50thPercentileLatency(us), 5459
[ADD_EDGE], 95thPercentileLatency(us), 52863
[ADD_EDGE], 99thPercentileLatency(us), 57279
[ADD_EDGE], Return=OK, 1021
[ADD_VERTEX], Operations, 968
[ADD_VERTEX], AverageLatency(us), 5301.012396694215
[ADD_VERTEX], MinLatency(us), 1612
[ADD_VERTEX], MaxLatency(us), 86015
[ADD_VERTEX], 50thPercentileLatency(us), 4755
[ADD_VERTEX], 95thPercentileLatency(us), 9567
[ADD_VERTEX], 99thPercentileLatency(us), 13071
[ADD_VERTEX], Return=OK, 968
[GET_VERTEX_WITH_PROPERTY], Operations, 964
[GET_VERTEX_WITH_PROPERTY], AverageLatency(us), 3227.201244813278
[GET_VERTEX_WITH_PROPERTY], MinLatency(us), 1614
[GET_VERTEX_WITH_PROPERTY], MaxLatency(us), 42175
[GET_VERTEX_WITH_PROPERTY], 50thPercentileLatency(us), 3047
[GET_VERTEX_WITH_PROPERTY], 95thPercentileLatency(us), 4651
[GET_VERTEX_WITH_PROPERTY], 99thPercentileLatency(us), 7675
[GET_VERTEX_WITH_PROPERTY], Return=OK, 964
[REMOVE_EDGE], Operations, 976
[REMOVE_EDGE], AverageLatency(us), 2927.0993852459014
[REMOVE_EDGE], MinLatency(us), 1492
[REMOVE_EDGE], MaxLatency(us), 13055
[REMOVE_EDGE], 50thPercentileLatency(us), 2859
[REMOVE_EDGE], 95thPercentileLatency(us), 4711
[REMOVE_EDGE], 99thPercentileLatency(us), 7719
[REMOVE_EDGE], Return=OK, 976
[REMOVE_EDGE_PROPERTY], Operations, 960
[REMOVE_EDGE_PROPERTY], AverageLatency(us), 5667.263541666666
[REMOVE_EDGE_PROPERTY], MinLatency(us), 1556
[REMOVE_EDGE_PROPERTY], MaxLatency(us), 20959
[REMOVE_EDGE_PROPERTY], 50thPercentileLatency(us), 3265
[REMOVE_EDGE_PROPERTY], 95thPercentileLatency(us), 10543
[REMOVE_EDGE_PROPERTY], 99thPercentileLatency(us), 12751
[REMOVE_EDGE_PROPERTY], Return=OK, 960
[GET_EDGE_LABELS], Operations, 943
[GET_EDGE_LABELS], AverageLatency(us), 3509.1622481442205
[GET_EDGE_LABELS], MinLatency(us), 1758
[GET_EDGE_LABELS], MaxLatency(us), 27199
[GET_EDGE_LABELS], 50thPercentileLatency(us), 3383
[GET_EDGE_LABELS], 95thPercentileLatency(us), 5043
[GET_EDGE_LABELS], 99thPercentileLatency(us), 7335
[GET_EDGE_LABELS], Return=OK, 943
[REMOVE_VERTEX_PROPERTY], Operations, 977
[REMOVE_VERTEX_PROPERTY], AverageLatency(us), 4036.4759467758445
[REMOVE_VERTEX_PROPERTY], MinLatency(us), 1578
[REMOVE_VERTEX_PROPERTY], MaxLatency(us), 32175
[REMOVE_VERTEX_PROPERTY], 50thPercentileLatency(us), 3317
[REMOVE_VERTEX_PROPERTY], 95thPercentileLatency(us), 6335
[REMOVE_VERTEX_PROPERTY], 99thPercentileLatency(us), 10239
[REMOVE_VERTEX_PROPERTY], Return=OK, 977
[GET_VERTEX_COUNT], Operations, 998
[GET_VERTEX_COUNT], AverageLatency(us), 2758.936873747495
[GET_VERTEX_COUNT], MinLatency(us), 1405
[GET_VERTEX_COUNT], MaxLatency(us), 18015
[GET_VERTEX_COUNT], 50thPercentileLatency(us), 2649
[GET_VERTEX_COUNT], 95thPercentileLatency(us), 4435
[GET_VERTEX_COUNT], 99thPercentileLatency(us), 7287
[GET_VERTEX_COUNT], Return=OK, 998
[GET_EDGES_WITH_LABEL], Operations, 936
[GET_EDGES_WITH_LABEL], AverageLatency(us), 2937.222222222222
[GET_EDGES_WITH_LABEL], MinLatency(us), 1446
[GET_EDGES_WITH_LABEL], MaxLatency(us), 85375
[GET_EDGES_WITH_LABEL], 50thPercentileLatency(us), 2689
[GET_EDGES_WITH_LABEL], 95thPercentileLatency(us), 4771
[GET_EDGES_WITH_LABEL], 99thPercentileLatency(us), 6783
[GET_EDGES_WITH_LABEL], Return=OK, 936
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 4.0
[CLEANUP], MinLatency(us), 4
[CLEANUP], MaxLatency(us), 4
[CLEANUP], 50thPercentileLatency(us), 4
[CLEANUP], 95thPercentileLatency(us), 4
[CLEANUP], 99thPercentileLatency(us), 4
[SET_EDGE_PROPERTY], Operations, 986
[SET_EDGE_PROPERTY], AverageLatency(us), 5813.117647058823
[SET_EDGE_PROPERTY], MinLatency(us), 1495
[SET_EDGE_PROPERTY], MaxLatency(us), 174975
[SET_EDGE_PROPERTY], 50thPercentileLatency(us), 3339
[SET_EDGE_PROPERTY], 95thPercentileLatency(us), 10527
[SET_EDGE_PROPERTY], 99thPercentileLatency(us), 13239
[SET_EDGE_PROPERTY], Return=OK, 986
[SET_VERTEX_PROPERTY], Operations, 953
[SET_VERTEX_PROPERTY], AverageLatency(us), 4071.547743966422
[SET_VERTEX_PROPERTY], MinLatency(us), 1566
[SET_VERTEX_PROPERTY], MaxLatency(us), 18287
[SET_VERTEX_PROPERTY], 50thPercentileLatency(us), 3329
[SET_VERTEX_PROPERTY], 95thPercentileLatency(us), 6399
[SET_VERTEX_PROPERTY], 99thPercentileLatency(us), 10423
[SET_VERTEX_PROPERTY], Return=OK, 953
[GET_EDGE_COUNT], Operations, 921
[GET_EDGE_COUNT], AverageLatency(us), 3119.99674267101
[GET_EDGE_COUNT], MinLatency(us), 1461
[GET_EDGE_COUNT], MaxLatency(us), 10943
[GET_EDGE_COUNT], 50thPercentileLatency(us), 2991
[GET_EDGE_COUNT], 95thPercentileLatency(us), 4839
[GET_EDGE_COUNT], 99thPercentileLatency(us), 6707
[GET_EDGE_COUNT], Return=OK, 921